c5/src/Documents/VATSales/VATSales.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>VATSales</name>
  <posting>Deny</posting>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Base</name>
    <type>
      <types>DocumentRef.AssetsWriteOff</types>
      <types>DocumentRef.WriteOff</types>
      <types>DocumentRef.Entry</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>Description</name>
    <type>
      <types>DefinedType.SaleDescription</types>
    </type>
  </attributes>
  <attributes>
    <name>FormNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>RecordDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Total</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VATCode</name>
    <type>
      <types>CatalogRef.VAT</types>
    </type>
  </attributes>
  <attributes>
    <name>VATRate</name>
    <type>
      <types>DefinedType.TaxRate</types>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

c5/src/Documents/VATSales/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Object.Ref.IsEmpty () ) then
		DocumentForm.Init ( Object );
		fillNew ();
	endif;
	StandardButtons.Arrange ( ThisObject );
	
EndProcedure

&AtServer
Procedure fillNew ()
	
	if ( not Parameters.CopyingValue.IsEmpty () ) then
		return;
	endif; 
	settings = Logins.Settings ( "Company" );
	Object.Company = settings.Company;
	Object.RecordDate = CurrentSessionDate ();
	
EndProcedure 

// *****************************************
// *********** Group Form

&AtClient
Procedure DateOnChange ( Item )
	
	setRecordDate ();
	
EndProcedure

&AtClient
Procedure setRecordDate ()
	
	Object.RecordDate = Object.Date;
	
EndProcedure 

&AtClient
Procedure SeriesOnChange ( Item )
	
	setNumber ();
	
EndProcedure

&AtClient
Procedure setNumber ()
	
	Object.Number = TrimR ( Object.Series ) + Object.FormNumber;
	
EndProcedure 

&AtClient
Procedure FormNumberOnChange ( Item )
	
	setNumber ();
	
EndProcedure

&AtClient
Procedure VATUseOnChange ( Item )
	
	Computations.Total ( Object, Object.VATUse );
	
EndProcedure

&AtClient
Procedure VATCodeOnChange ( Item )
	
	Object.VATRate = DF.Pick ( Object.VATCode, "Rate" );
	Computations.Total ( Object, Object.VATUse );
	
EndProcedure

&AtClient
Procedure VATOnChange ( Item )
	
	Computations.Total ( Object, Object.VATUse, false );
	
EndProcedure

&AtClient
Procedure AmountOnChange ( Item )
	
	Computations.Total ( Object, Object.VATUse );
	
EndProcedure
